[Killed] Block removal mutation
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:53:9
         #region Ctor
         public Game(byte mapX, byte mapY, byte startingSpeed, short framesPerSecond, EGameType gameType, 
             int deductSpeedMS, int deductAmount, int speedIncreaseThreshold)
-        {
-            Snake = new Snake((byte)((mapX / 2) + 1), (byte)((mapY / 2) + 1), 5);
-            MapX = mapX;
-            MapY = mapY;
-            DeductSpeedMS = deductSpeedMS;
-            DeductAmount = deductAmount;
-            SpeedIncreaseThreshold = speedIncreaseThreshold;
-            StartingSpeed = startingSpeed;
-            Speed = startingSpeed;
-            FPS = framesPerSecond;
-            GameType = gameType;
-            updateTimer = new Stopwatch();
-            drawTimer = new Stopwatch();
-            pointDeductTimer = new Stopwatch();
-            applePositionGenerator = new Random();
-        }
+        {}
         #endregion
 

[Killed] Arithmetic mutation
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:54:63
         public Game(byte mapX, byte mapY, byte startingSpeed, short framesPerSecond, EGameType gameType, 
             int deductSpeedMS, int deductAmount, int speedIncreaseThreshold)
         {
-            Snake = new Snake((byte)((mapX / 2) + 1), (byte)((mapY / 2) + 1), 5);
+            Snake = new Snake((byte)((mapX / 2) + 1), (byte)((mapY * 2) + 1), 5);
             MapX = mapX;
             MapY = mapY;

[Killed] Arithmetic mutation
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:54:62
         public Game(byte mapX, byte mapY, byte startingSpeed, short framesPerSecond, EGameType gameType, 
             int deductSpeedMS, int deductAmount, int speedIncreaseThreshold)
         {
-            Snake = new Snake((byte)((mapX / 2) + 1), (byte)((mapY / 2) + 1), 5);
+            Snake = new Snake((byte)((mapX / 2) + 1), (byte)((mapY / 2) - 1), 5);
             MapX = mapX;
             MapY = mapY;

[Killed] Block removal mutation
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:76:9
         /// Initializes the game. Should only be called once in a games life cycle.
         /// </summary>
         public virtual void Initialize()
-        {
-            //init snake
-            Snake.Initialize();
-            //generate first apple position
-            ApplePosition = new byte[2] { (byte)applePositionGenerator.Next(1,MapX),
-                                        (byte)applePositionGenerator.Next(1, MapY) };
-            //start timers
-            updateTimer.Start();
-            drawTimer.Start();
-            pointDeductTimer.Start();
-            //flag the game as running
-            GameState = EGameState.Running;
-            PausedState = EPauseState.Unpaused;
-            DebugState = EDebugState.NotDebugging;
-        }
+        {}
         #endregion
 

[Killed] Statement mutation
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:78:13
         public virtual void Initialize()
         {
             //init snake
-            Snake.Initialize();
+            ;
             //generate first apple position
             ApplePosition = new byte[2] { (byte)applePositionGenerator.Next(1,MapX),

[Survived] Statement mutation
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:83:13
             ApplePosition = new byte[2] { (byte)applePositionGenerator.Next(1,MapX),
                                         (byte)applePositionGenerator.Next(1, MapY) };
             //start timers
-            updateTimer.Start();
+            ;
             drawTimer.Start();
             pointDeductTimer.Start();

[Survived] Statement mutation
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:84:13
                                         (byte)applePositionGenerator.Next(1, MapY) };
             //start timers
             updateTimer.Start();
-            drawTimer.Start();
+            ;
             pointDeductTimer.Start();
             //flag the game as running

[Killed] Statement mutation
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:85:13
             //start timers
             updateTimer.Start();
             drawTimer.Start();
-            pointDeductTimer.Start();
+            ;
             //flag the game as running
             GameState = EGameState.Running;

[Killed] Statement mutation
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:100:13
         public virtual void Update()
         {
             //update snake
-            Snake.Update();
+            ;
             //check if snake head collides with food
             if (ApplePosition != null &&

[Killed] Negate expression
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:102:17
             //update snake
             Snake.Update();
             //check if snake head collides with food
-            if (ApplePosition != null &&
-                Snake.BodyPositions.First()[0] == ApplePosition[0] &&
-                Snake.BodyPositions.First()[1] == ApplePosition[1])
+            if (!(ApplePosition != null &&
+                Snake.BodyPositions.First()[0] == ApplePosition[0] &&
+                Snake.BodyPositions.First()[1] == ApplePosition[1]))
             {
                 //offset food with snake direction

[Killed] Logical mutation
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:102:17
             //update snake
             Snake.Update();
             //check if snake head collides with food
-            if (ApplePosition != null &&
-                Snake.BodyPositions.First()[0] == ApplePosition[0] &&
-                Snake.BodyPositions.First()[1] == ApplePosition[1])
+            if (ApplePosition != null &&
+                Snake.BodyPositions.First()[0] == ApplePosition[0] ||
+                Snake.BodyPositions.First()[1] == ApplePosition[1])
             {
                 //offset food with snake direction

[Killed] Equality mutation
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:103:17
             Snake.Update();
             //check if snake head collides with food
             if (ApplePosition != null &&
-                Snake.BodyPositions.First()[0] == ApplePosition[0] &&
+                                Snake.BodyPositions.First()[0] != ApplePosition[0]  &&
                 Snake.BodyPositions.First()[1] == ApplePosition[1])
             {

[Survived] Linq method mutation (First() to FirstOrDefault())
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:103:17
             Snake.Update();
             //check if snake head collides with food
             if (ApplePosition != null &&
-                Snake.BodyPositions.First()[0] == ApplePosition[0] &&
+                                Snake.BodyPositions.FirstOrDefault()[0] == ApplePosition[0] &&
                 Snake.BodyPositions.First()[1] == ApplePosition[1])
             {

[Killed] Equality mutation
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:104:17
             //check if snake head collides with food
             if (ApplePosition != null &&
                 Snake.BodyPositions.First()[0] == ApplePosition[0] &&
-                Snake.BodyPositions.First()[1] == ApplePosition[1])
+                                Snake.BodyPositions.First()[1] != ApplePosition[1])
             {
                 //offset food with snake direction

[Survived] Linq method mutation (First() to FirstOrDefault())
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:104:17
             //check if snake head collides with food
             if (ApplePosition != null &&
                 Snake.BodyPositions.First()[0] == ApplePosition[0] &&
-                Snake.BodyPositions.First()[1] == ApplePosition[1])
+                                Snake.BodyPositions.FirstOrDefault()[1] == ApplePosition[1])
             {
                 //offset food with snake direction

[Killed] Block removal mutation
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:105:13
             if (ApplePosition != null &&
                 Snake.BodyPositions.First()[0] == ApplePosition[0] &&
                 Snake.BodyPositions.First()[1] == ApplePosition[1])
-            {
-                //offset food with snake direction
-                if (Snake.Direction == EDirectionType.UP) ApplePosition[1]--;
-                else if (Snake.Direction == EDirectionType.DOWN) ApplePosition[1]++;
-                else if (Snake.Direction == EDirectionType.LEFT) ApplePosition[0]--;
-                else if (Snake.Direction == EDirectionType.RIGHT) ApplePosition[0]++;
-                //make snake longer, add points 
-                Snake.BodyPositions.AddFirst(ApplePosition);
-                Snake.Points += Speed * Snake.BodyPositions.Count;
-                //generate tentative food within bounds and not on snake
-                byte[] tentativeFoodPosition;
-                //confirm tentative food
-                do tentativeFoodPosition = new byte[2] { (byte)applePositionGenerator.Next(1,MapX),
-                                        (byte)applePositionGenerator.Next(1, MapY) };
-                while (tentativeFoodPosition[0] == Snake.BodyPositions.First()[0] &&
-                       tentativeFoodPosition[1] == Snake.BodyPositions.First()[1] &&
-                       Snake.Collide(tentativeFoodPosition));
-                //add new food
-                ApplePosition = tentativeFoodPosition;
-                pointDeductTimer.Restart();
-            }
+            {}
             //
             if (pointDeductTimer.ElapsedMilliseconds > DeductSpeedMS)

[Killed] Equality mutation
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:107:21
                 Snake.BodyPositions.First()[1] == ApplePosition[1])
             {
                 //offset food with snake direction
-                if (Snake.Direction == EDirectionType.UP) ApplePosition[1]--;
+                if (Snake.Direction != EDirectionType.UP) ApplePosition[1]--;
                 else if (Snake.Direction == EDirectionType.DOWN) ApplePosition[1]++;
                 else if (Snake.Direction == EDirectionType.LEFT) ApplePosition[0]--;

[NoCoverage] Statement mutation
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:107:59
                 Snake.BodyPositions.First()[1] == ApplePosition[1])
             {
                 //offset food with snake direction
-                if (Snake.Direction == EDirectionType.UP) ApplePosition[1]--;
+                if (Snake.Direction == EDirectionType.UP) ;
                 else if (Snake.Direction == EDirectionType.DOWN) ApplePosition[1]++;
                 else if (Snake.Direction == EDirectionType.LEFT) ApplePosition[0]--;

[Killed] Equality mutation
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:108:26
             {
                 //offset food with snake direction
                 if (Snake.Direction == EDirectionType.UP) ApplePosition[1]--;
-                else if (Snake.Direction == EDirectionType.DOWN) ApplePosition[1]++;
+                else if (Snake.Direction != EDirectionType.DOWN) ApplePosition[1]++;
                 else if (Snake.Direction == EDirectionType.LEFT) ApplePosition[0]--;
                 else if (Snake.Direction == EDirectionType.RIGHT) ApplePosition[0]++;

[NoCoverage] PostIncrementExpression to PostDecrementExpression mutation
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:108:66
             {
                 //offset food with snake direction
                 if (Snake.Direction == EDirectionType.UP) ApplePosition[1]--;
-                else if (Snake.Direction == EDirectionType.DOWN) ApplePosition[1]++;
+                else if (Snake.Direction == EDirectionType.DOWN) ApplePosition[1]--;
                 else if (Snake.Direction == EDirectionType.LEFT) ApplePosition[0]--;
                 else if (Snake.Direction == EDirectionType.RIGHT) ApplePosition[0]++;

[Killed] Equality mutation
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:109:26
                 //offset food with snake direction
                 if (Snake.Direction == EDirectionType.UP) ApplePosition[1]--;
                 else if (Snake.Direction == EDirectionType.DOWN) ApplePosition[1]++;
-                else if (Snake.Direction == EDirectionType.LEFT) ApplePosition[0]--;
+                else if (Snake.Direction != EDirectionType.LEFT) ApplePosition[0]--;
                 else if (Snake.Direction == EDirectionType.RIGHT) ApplePosition[0]++;
                 //make snake longer, add points 

[NoCoverage] Statement mutation
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:109:66
                 //offset food with snake direction
                 if (Snake.Direction == EDirectionType.UP) ApplePosition[1]--;
                 else if (Snake.Direction == EDirectionType.DOWN) ApplePosition[1]++;
-                else if (Snake.Direction == EDirectionType.LEFT) ApplePosition[0]--;
+                else if (Snake.Direction == EDirectionType.LEFT) ;
                 else if (Snake.Direction == EDirectionType.RIGHT) ApplePosition[0]++;
                 //make snake longer, add points 

[Killed] Statement mutation
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:110:67
                 if (Snake.Direction == EDirectionType.UP) ApplePosition[1]--;
                 else if (Snake.Direction == EDirectionType.DOWN) ApplePosition[1]++;
                 else if (Snake.Direction == EDirectionType.LEFT) ApplePosition[0]--;
-                else if (Snake.Direction == EDirectionType.RIGHT) ApplePosition[0]++;
+                else if (Snake.Direction == EDirectionType.RIGHT) ;
                 //make snake longer, add points 
                 Snake.BodyPositions.AddFirst(ApplePosition);

[Killed] PostIncrementExpression to PostDecrementExpression mutation
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:110:67
                 if (Snake.Direction == EDirectionType.UP) ApplePosition[1]--;
                 else if (Snake.Direction == EDirectionType.DOWN) ApplePosition[1]++;
                 else if (Snake.Direction == EDirectionType.LEFT) ApplePosition[0]--;
-                else if (Snake.Direction == EDirectionType.RIGHT) ApplePosition[0]++;
+                else if (Snake.Direction == EDirectionType.RIGHT) ApplePosition[0]--;
                 //make snake longer, add points 
                 Snake.BodyPositions.AddFirst(ApplePosition);

[Killed] Statement mutation
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:112:17
                 else if (Snake.Direction == EDirectionType.LEFT) ApplePosition[0]--;
                 else if (Snake.Direction == EDirectionType.RIGHT) ApplePosition[0]++;
                 //make snake longer, add points 
-                Snake.BodyPositions.AddFirst(ApplePosition);
+                ;
                 Snake.Points += Speed * Snake.BodyPositions.Count;
                 //generate tentative food within bounds and not on snake

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:113:17
                 else if (Snake.Direction == EDirectionType.RIGHT) ApplePosition[0]++;
                 //make snake longer, add points 
                 Snake.BodyPositions.AddFirst(ApplePosition);
-                Snake.Points += Speed * Snake.BodyPositions.Count;
+                                Snake.Points -=Speed * Snake.BodyPositions.Count;
                 //generate tentative food within bounds and not on snake
                 byte[] tentativeFoodPosition;

[Killed] Arithmetic mutation
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:113:33
                 else if (Snake.Direction == EDirectionType.RIGHT) ApplePosition[0]++;
                 //make snake longer, add points 
                 Snake.BodyPositions.AddFirst(ApplePosition);
-                Snake.Points += Speed * Snake.BodyPositions.Count;
+                Snake.Points += Speed / Snake.BodyPositions.Count;
                 //generate tentative food within bounds and not on snake
                 byte[] tentativeFoodPosition;

[Survived] Logical mutation
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:119:24
                 //confirm tentative food
                 do tentativeFoodPosition = new byte[2] { (byte)applePositionGenerator.Next(1,MapX),
                                         (byte)applePositionGenerator.Next(1, MapY) };
-                while (tentativeFoodPosition[0] == Snake.BodyPositions.First()[0] &&
-                       tentativeFoodPosition[1] == Snake.BodyPositions.First()[1] &&
-                       Snake.Collide(tentativeFoodPosition));
+                while (tentativeFoodPosition[0] == Snake.BodyPositions.First()[0] &&
+                       tentativeFoodPosition[1] == Snake.BodyPositions.First()[1] ||
+                       Snake.Collide(tentativeFoodPosition));
                 //add new food
                 ApplePosition = tentativeFoodPosition;

[Survived] Linq method mutation (First() to FirstOrDefault())
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:119:52
                 //confirm tentative food
                 do tentativeFoodPosition = new byte[2] { (byte)applePositionGenerator.Next(1,MapX),
                                         (byte)applePositionGenerator.Next(1, MapY) };
-                while (tentativeFoodPosition[0] == Snake.BodyPositions.First()[0] &&
+                while (tentativeFoodPosition[0] == Snake.BodyPositions.FirstOrDefault()[0] &&
                        tentativeFoodPosition[1] == Snake.BodyPositions.First()[1] &&
                        Snake.Collide(tentativeFoodPosition));

[NoCoverage] Equality mutation
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:120:24
                 do tentativeFoodPosition = new byte[2] { (byte)applePositionGenerator.Next(1,MapX),
                                         (byte)applePositionGenerator.Next(1, MapY) };
                 while (tentativeFoodPosition[0] == Snake.BodyPositions.First()[0] &&
-                       tentativeFoodPosition[1] == Snake.BodyPositions.First()[1] &&
+                                              tentativeFoodPosition[1] != Snake.BodyPositions.First()[1]  &&
                        Snake.Collide(tentativeFoodPosition));
                 //add new food

[NoCoverage] Linq method mutation (First() to FirstOrDefault())
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:120:52
                 do tentativeFoodPosition = new byte[2] { (byte)applePositionGenerator.Next(1,MapX),
                                         (byte)applePositionGenerator.Next(1, MapY) };
                 while (tentativeFoodPosition[0] == Snake.BodyPositions.First()[0] &&
-                       tentativeFoodPosition[1] == Snake.BodyPositions.First()[1] &&
+                       tentativeFoodPosition[1] == Snake.BodyPositions.FirstOrDefault()[1] &&
                        Snake.Collide(tentativeFoodPosition));
                 //add new food

[Survived] Statement mutation
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:124:17
                        Snake.Collide(tentativeFoodPosition));
                 //add new food
                 ApplePosition = tentativeFoodPosition;
-                pointDeductTimer.Restart();
+                ;
             }
             //

[Killed] Negate expression
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:127:17
                 pointDeductTimer.Restart();
             }
             //
-            if (pointDeductTimer.ElapsedMilliseconds > DeductSpeedMS)
+            if (!(pointDeductTimer.ElapsedMilliseconds > DeductSpeedMS))
             {
                 Snake.Points -= DeductAmount;

[Killed] Equality mutation
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:127:17
                 pointDeductTimer.Restart();
             }
             //
-            if (pointDeductTimer.ElapsedMilliseconds > DeductSpeedMS)
+            if (pointDeductTimer.ElapsedMilliseconds < DeductSpeedMS)
             {
                 Snake.Points -= DeductAmount;

[Killed] Block removal mutation
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:128:13
             }
             //
             if (pointDeductTimer.ElapsedMilliseconds > DeductSpeedMS)
-            {
-                Snake.Points -= DeductAmount;
-                pointDeductTimer.Restart();
-            }
+            {}
             //check if snake is out of bounds, teleport if it is
             if (GameType == EGameType.Teleport)

[Killed] SubtractAssignmentExpression to AddAssignmentExpression mutation
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:129:17
             //
             if (pointDeductTimer.ElapsedMilliseconds > DeductSpeedMS)
             {
-                Snake.Points -= DeductAmount;
+                                Snake.Points +=DeductAmount;
                 pointDeductTimer.Restart();
             }

[Survived] Statement mutation
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:130:17
             if (pointDeductTimer.ElapsedMilliseconds > DeductSpeedMS)
             {
                 Snake.Points -= DeductAmount;
-                pointDeductTimer.Restart();
+                ;
             }
             //check if snake is out of bounds, teleport if it is

[Killed] Equality mutation
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:133:17
                 pointDeductTimer.Restart();
             }
             //check if snake is out of bounds, teleport if it is
-            if (GameType == EGameType.Teleport)
+            if (GameType != EGameType.Teleport)
             {
                 if (Snake.BodyPositions.First()[0] <= 0)

[Timeout] Block removal mutation
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:134:13
             }
             //check if snake is out of bounds, teleport if it is
             if (GameType == EGameType.Teleport)
-            {
-                if (Snake.BodyPositions.First()[0] <= 0)
-                    Snake.BodyPositions.First()[0] = (byte)(MapX - 1);
-                else if (Snake.BodyPositions.First()[0] >= MapX)
-                    Snake.BodyPositions.First()[0] = 1;
-                else if (Snake.BodyPositions.First()[1] <= 0)
-                    Snake.BodyPositions.First()[1] = (byte)(MapY - 1);
-                else if (Snake.BodyPositions.First()[1] >= MapY)
-                    Snake.BodyPositions.First()[1] = 1;
-            }
+            {}
             //else if snake is out of bounds, end game if it is
             else

[Killed] Equality mutation
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:135:21
             //check if snake is out of bounds, teleport if it is
             if (GameType == EGameType.Teleport)
             {
-                if (Snake.BodyPositions.First()[0] <= 0)
+                if (Snake.BodyPositions.First()[0] > 0)
                     Snake.BodyPositions.First()[0] = (byte)(MapX - 1);
                 else if (Snake.BodyPositions.First()[0] >= MapX)

[Killed] Negate expression
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:135:21
             //check if snake is out of bounds, teleport if it is
             if (GameType == EGameType.Teleport)
             {
-                if (Snake.BodyPositions.First()[0] <= 0)
+                if (!(Snake.BodyPositions.First()[0] <= 0))
                     Snake.BodyPositions.First()[0] = (byte)(MapX - 1);
                 else if (Snake.BodyPositions.First()[0] >= MapX)

[Survived] Linq method mutation (First() to FirstOrDefault())
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:136:21
             if (GameType == EGameType.Teleport)
             {
                 if (Snake.BodyPositions.First()[0] <= 0)
-                    Snake.BodyPositions.First()[0] = (byte)(MapX - 1);
+                                        Snake.BodyPositions.FirstOrDefault()[0] = (byte)(MapX - 1);
                 else if (Snake.BodyPositions.First()[0] >= MapX)
                     Snake.BodyPositions.First()[0] = 1;

[Timeout] Arithmetic mutation
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:136:61
             if (GameType == EGameType.Teleport)
             {
                 if (Snake.BodyPositions.First()[0] <= 0)
-                    Snake.BodyPositions.First()[0] = (byte)(MapX - 1);
+                    Snake.BodyPositions.First()[0] = (byte)(MapX + 1);
                 else if (Snake.BodyPositions.First()[0] >= MapX)
                     Snake.BodyPositions.First()[0] = 1;

[Killed] Equality mutation
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:137:26
             {
                 if (Snake.BodyPositions.First()[0] <= 0)
                     Snake.BodyPositions.First()[0] = (byte)(MapX - 1);
-                else if (Snake.BodyPositions.First()[0] >= MapX)
+                else if (Snake.BodyPositions.First()[0] < MapX)
                     Snake.BodyPositions.First()[0] = 1;
                 else if (Snake.BodyPositions.First()[1] <= 0)

[Killed] Negate expression
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:137:26
             {
                 if (Snake.BodyPositions.First()[0] <= 0)
                     Snake.BodyPositions.First()[0] = (byte)(MapX - 1);
-                else if (Snake.BodyPositions.First()[0] >= MapX)
+                else if (!(Snake.BodyPositions.First()[0] >= MapX))
                     Snake.BodyPositions.First()[0] = 1;
                 else if (Snake.BodyPositions.First()[1] <= 0)

[Survived] Linq method mutation (First() to FirstOrDefault())
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:138:21
                 if (Snake.BodyPositions.First()[0] <= 0)
                     Snake.BodyPositions.First()[0] = (byte)(MapX - 1);
                 else if (Snake.BodyPositions.First()[0] >= MapX)
-                    Snake.BodyPositions.First()[0] = 1;
+                                        Snake.BodyPositions.FirstOrDefault()[0] = 1;
                 else if (Snake.BodyPositions.First()[1] <= 0)
                     Snake.BodyPositions.First()[1] = (byte)(MapY - 1);

[Killed] Equality mutation
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:139:26
                     Snake.BodyPositions.First()[0] = (byte)(MapX - 1);
                 else if (Snake.BodyPositions.First()[0] >= MapX)
                     Snake.BodyPositions.First()[0] = 1;
-                else if (Snake.BodyPositions.First()[1] <= 0)
+                else if (Snake.BodyPositions.First()[1] > 0)
                     Snake.BodyPositions.First()[1] = (byte)(MapY - 1);
                 else if (Snake.BodyPositions.First()[1] >= MapY)

[Killed] Negate expression
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:139:26
                     Snake.BodyPositions.First()[0] = (byte)(MapX - 1);
                 else if (Snake.BodyPositions.First()[0] >= MapX)
                     Snake.BodyPositions.First()[0] = 1;
-                else if (Snake.BodyPositions.First()[1] <= 0)
+                else if (!(Snake.BodyPositions.First()[1] <= 0))
                     Snake.BodyPositions.First()[1] = (byte)(MapY - 1);
                 else if (Snake.BodyPositions.First()[1] >= MapY)

[Survived] Linq method mutation (First() to FirstOrDefault())
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:140:21
                 else if (Snake.BodyPositions.First()[0] >= MapX)
                     Snake.BodyPositions.First()[0] = 1;
                 else if (Snake.BodyPositions.First()[1] <= 0)
-                    Snake.BodyPositions.First()[1] = (byte)(MapY - 1);
+                                        Snake.BodyPositions.FirstOrDefault()[1] = (byte)(MapY - 1);
                 else if (Snake.BodyPositions.First()[1] >= MapY)
                     Snake.BodyPositions.First()[1] = 1;

[Survived] Arithmetic mutation
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:140:61
                 else if (Snake.BodyPositions.First()[0] >= MapX)
                     Snake.BodyPositions.First()[0] = 1;
                 else if (Snake.BodyPositions.First()[1] <= 0)
-                    Snake.BodyPositions.First()[1] = (byte)(MapY - 1);
+                    Snake.BodyPositions.First()[1] = (byte)(MapY + 1);
                 else if (Snake.BodyPositions.First()[1] >= MapY)
                     Snake.BodyPositions.First()[1] = 1;

[Killed] Equality mutation
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:141:26
                     Snake.BodyPositions.First()[0] = 1;
                 else if (Snake.BodyPositions.First()[1] <= 0)
                     Snake.BodyPositions.First()[1] = (byte)(MapY - 1);
-                else if (Snake.BodyPositions.First()[1] >= MapY)
+                else if (Snake.BodyPositions.First()[1] < MapY)
                     Snake.BodyPositions.First()[1] = 1;
             }

[Killed] Negate expression
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:141:26
                     Snake.BodyPositions.First()[0] = 1;
                 else if (Snake.BodyPositions.First()[1] <= 0)
                     Snake.BodyPositions.First()[1] = (byte)(MapY - 1);
-                else if (Snake.BodyPositions.First()[1] >= MapY)
+                else if (!(Snake.BodyPositions.First()[1] >= MapY))
                     Snake.BodyPositions.First()[1] = 1;
             }

[Survived] Linq method mutation (First() to FirstOrDefault())
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:142:21
                 else if (Snake.BodyPositions.First()[1] <= 0)
                     Snake.BodyPositions.First()[1] = (byte)(MapY - 1);
                 else if (Snake.BodyPositions.First()[1] >= MapY)
-                    Snake.BodyPositions.First()[1] = 1;
+                                        Snake.BodyPositions.FirstOrDefault()[1] = 1;
             }
             //else if snake is out of bounds, end game if it is

[Killed] Block removal mutation
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:146:13
             }
             //else if snake is out of bounds, end game if it is
             else
-            {
-                if (Snake.BodyPositions.First()[0] <= 0) GameState = EGameState.NotRunning;
-                else if (Snake.BodyPositions.First()[0] >= MapX) GameState = EGameState.NotRunning;
-                else if (Snake.BodyPositions.First()[1] <= 0) GameState = EGameState.NotRunning;
-                else if (Snake.BodyPositions.First()[1] >= MapY) GameState = EGameState.NotRunning;
-            }
+            {}
             //check if snake collided with self
             if (Snake.CollisionWithSelf) GameState = EGameState.NotRunning;
