[Survived] Equality mutation
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:147:21
             //else if snake is out of bounds, end game if it is
             else
             {
-                if (Snake.BodyPositions.First()[0] <= 0) GameState = EGameState.NotRunning;
+                if (Snake.BodyPositions.First()[0] < 0) GameState = EGameState.NotRunning;
                 else if (Snake.BodyPositions.First()[0] >= MapX) GameState = EGameState.NotRunning;
                 else if (Snake.BodyPositions.First()[1] <= 0) GameState = EGameState.NotRunning;

[Survived] Negate expression
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:147:21
             //else if snake is out of bounds, end game if it is
             else
             {
-                if (Snake.BodyPositions.First()[0] <= 0) GameState = EGameState.NotRunning;
+                if (!(Snake.BodyPositions.First()[0] <= 0)) GameState = EGameState.NotRunning;
                 else if (Snake.BodyPositions.First()[0] >= MapX) GameState = EGameState.NotRunning;
                 else if (Snake.BodyPositions.First()[1] <= 0) GameState = EGameState.NotRunning;

[Survived] Equality mutation
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:148:26
             else
             {
                 if (Snake.BodyPositions.First()[0] <= 0) GameState = EGameState.NotRunning;
-                else if (Snake.BodyPositions.First()[0] >= MapX) GameState = EGameState.NotRunning;
+                else if (Snake.BodyPositions.First()[0] < MapX) GameState = EGameState.NotRunning;
                 else if (Snake.BodyPositions.First()[1] <= 0) GameState = EGameState.NotRunning;
                 else if (Snake.BodyPositions.First()[1] >= MapY) GameState = EGameState.NotRunning;

[Survived] Negate expression
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:148:26
             else
             {
                 if (Snake.BodyPositions.First()[0] <= 0) GameState = EGameState.NotRunning;
-                else if (Snake.BodyPositions.First()[0] >= MapX) GameState = EGameState.NotRunning;
+                else if (!(Snake.BodyPositions.First()[0] >= MapX)) GameState = EGameState.NotRunning;
                 else if (Snake.BodyPositions.First()[1] <= 0) GameState = EGameState.NotRunning;
                 else if (Snake.BodyPositions.First()[1] >= MapY) GameState = EGameState.NotRunning;

[Killed] Equality mutation
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:149:26
             {
                 if (Snake.BodyPositions.First()[0] <= 0) GameState = EGameState.NotRunning;
                 else if (Snake.BodyPositions.First()[0] >= MapX) GameState = EGameState.NotRunning;
-                else if (Snake.BodyPositions.First()[1] <= 0) GameState = EGameState.NotRunning;
+                else if (Snake.BodyPositions.First()[1] < 0) GameState = EGameState.NotRunning;
                 else if (Snake.BodyPositions.First()[1] >= MapY) GameState = EGameState.NotRunning;
             }

[Survived] Linq method mutation (First() to FirstOrDefault())
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:149:26
             {
                 if (Snake.BodyPositions.First()[0] <= 0) GameState = EGameState.NotRunning;
                 else if (Snake.BodyPositions.First()[0] >= MapX) GameState = EGameState.NotRunning;
-                else if (Snake.BodyPositions.First()[1] <= 0) GameState = EGameState.NotRunning;
+                else if (Snake.BodyPositions.FirstOrDefault()[1] <= 0) GameState = EGameState.NotRunning;
                 else if (Snake.BodyPositions.First()[1] >= MapY) GameState = EGameState.NotRunning;
             }

[Survived] Equality mutation
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:150:26
                 if (Snake.BodyPositions.First()[0] <= 0) GameState = EGameState.NotRunning;
                 else if (Snake.BodyPositions.First()[0] >= MapX) GameState = EGameState.NotRunning;
                 else if (Snake.BodyPositions.First()[1] <= 0) GameState = EGameState.NotRunning;
-                else if (Snake.BodyPositions.First()[1] >= MapY) GameState = EGameState.NotRunning;
+                else if (Snake.BodyPositions.First()[1] > MapY) GameState = EGameState.NotRunning;
             }
             //check if snake collided with self

[Survived] Equality mutation
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:150:26
                 if (Snake.BodyPositions.First()[0] <= 0) GameState = EGameState.NotRunning;
                 else if (Snake.BodyPositions.First()[0] >= MapX) GameState = EGameState.NotRunning;
                 else if (Snake.BodyPositions.First()[1] <= 0) GameState = EGameState.NotRunning;
-                else if (Snake.BodyPositions.First()[1] >= MapY) GameState = EGameState.NotRunning;
+                else if (Snake.BodyPositions.First()[1] < MapY) GameState = EGameState.NotRunning;
             }
             //check if snake collided with self

[Killed] Negate expression
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:153:17
                 else if (Snake.BodyPositions.First()[1] >= MapY) GameState = EGameState.NotRunning;
             }
             //check if snake collided with self
-            if (Snake.CollisionWithSelf) GameState = EGameState.NotRunning;
+            if (!(Snake.CollisionWithSelf)) GameState = EGameState.NotRunning;
             //set game speed
             Speed = (byte)(StartingSpeed + (Snake.Points / SpeedIncreaseThreshold));

[Killed] Arithmetic mutation
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:155:45
             //check if snake collided with self
             if (Snake.CollisionWithSelf) GameState = EGameState.NotRunning;
             //set game speed
-            Speed = (byte)(StartingSpeed + (Snake.Points / SpeedIncreaseThreshold));
+            Speed = (byte)(StartingSpeed + (Snake.Points * SpeedIncreaseThreshold));
             //reset update timer
             updateTimer.Restart();

[Killed] Arithmetic mutation
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:155:28
             //check if snake collided with self
             if (Snake.CollisionWithSelf) GameState = EGameState.NotRunning;
             //set game speed
-            Speed = (byte)(StartingSpeed + (Snake.Points / SpeedIncreaseThreshold));
+            Speed = (byte)(StartingSpeed - (Snake.Points / SpeedIncreaseThreshold));
             //reset update timer
             updateTimer.Restart();

[Survived] Statement mutation
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:157:13
             //set game speed
             Speed = (byte)(StartingSpeed + (Snake.Points / SpeedIncreaseThreshold));
             //reset update timer
-            updateTimer.Restart();
+            ;
         }
         #endregion
