[Killed] Block removal mutation
repos/SnakeGameCSharp/SnakeGameLib/Snake.cs:21:13
         public int Points
         {
             get
-            {
-                return points;
-            }
+            {}
             set
             {

[Killed] Block removal mutation
repos/SnakeGameCSharp/SnakeGameLib/Snake.cs:25:13
                 return points;
             }
             set
-            {
-                //clamp to zero, because points can never be below zero
-                points = Math.Clamp(value, 0, int.MaxValue);
-            }
+            {}
         }
         #endregion

[Killed] Block removal mutation
repos/SnakeGameCSharp/SnakeGameLib/Snake.cs:34:9
 
         #region Ctor
         public Snake(byte startX, byte startY, byte initialSize)
-        {
-            CollisionWithSelf = false;
-            DirectionQueue = new Queue<EDirectionType>();
-            BodyPositions = new LinkedList<byte[]>();
-
-            for (int i = 0; i < initialSize; i++)
-                BodyPositions.AddLast(new byte[2] { (byte)(startX - i), startY });
-        }
+        {}
         #endregion
 

[Killed] Boolean mutation
repos/SnakeGameCSharp/SnakeGameLib/Snake.cs:35:33
         #region Ctor
         public Snake(byte startX, byte startY, byte initialSize)
         {
-            CollisionWithSelf = false;
+            CollisionWithSelf = true;
             DirectionQueue = new Queue<EDirectionType>();
             BodyPositions = new LinkedList<byte[]>();

[Killed] Equality mutation
repos/SnakeGameCSharp/SnakeGameLib/Snake.cs:39:29
             DirectionQueue = new Queue<EDirectionType>();
             BodyPositions = new LinkedList<byte[]>();
 
-            for (int i = 0; i < initialSize; i++)
+            for (int i = 0; i > initialSize; i++)
                 BodyPositions.AddLast(new byte[2] { (byte)(startX - i), startY });
         }

[Killed] Equality mutation
repos/SnakeGameCSharp/SnakeGameLib/Snake.cs:39:29
             DirectionQueue = new Queue<EDirectionType>();
             BodyPositions = new LinkedList<byte[]>();
 
-            for (int i = 0; i < initialSize; i++)
+            for (int i = 0; i <= initialSize; i++)
                 BodyPositions.AddLast(new byte[2] { (byte)(startX - i), startY });
         }

[Killed] Arithmetic mutation
repos/SnakeGameCSharp/SnakeGameLib/Snake.cs:40:60
             BodyPositions = new LinkedList<byte[]>();
 
             for (int i = 0; i < initialSize; i++)
-                BodyPositions.AddLast(new byte[2] { (byte)(startX - i), startY });
+                BodyPositions.AddLast(new byte[2] { (byte)(startX + i), startY });
         }
         #endregion

[Killed] Statement mutation
repos/SnakeGameCSharp/SnakeGameLib/Snake.cs:40:17
             BodyPositions = new LinkedList<byte[]>();
 
             for (int i = 0; i < initialSize; i++)
-                BodyPositions.AddLast(new byte[2] { (byte)(startX - i), startY });
+                ;
         }
         #endregion

[Killed] Block removal mutation
repos/SnakeGameCSharp/SnakeGameLib/Snake.cs:49:9
         /// Initialize snake.
         /// </summary>
         public virtual void Initialize()
-        {
-            DirectionQueue.Enqueue(EDirectionType.RIGHT);
-        }
+        {}
         #endregion
 

[Killed] Statement mutation
repos/SnakeGameCSharp/SnakeGameLib/Snake.cs:50:13
         /// </summary>
         public virtual void Initialize()
         {
-            DirectionQueue.Enqueue(EDirectionType.RIGHT);
+            ;
         }
         #endregion

[Killed] Equality mutation
repos/SnakeGameCSharp/SnakeGameLib/Snake.cs:61:17
         public virtual void Update()
         {
             //set a new direction if there are any on queue and direction is valid
-            if (DirectionQueue.Count > 0)
+            if (DirectionQueue.Count < 0)
             {
                 EDirectionType tentativeDirection = DirectionQueue.Dequeue();

[Killed] Negate expression
repos/SnakeGameCSharp/SnakeGameLib/Snake.cs:61:17
         public virtual void Update()
         {
             //set a new direction if there are any on queue and direction is valid
-            if (DirectionQueue.Count > 0)
+            if (!(DirectionQueue.Count > 0))
             {
                 EDirectionType tentativeDirection = DirectionQueue.Dequeue();

[Killed] Block removal mutation
repos/SnakeGameCSharp/SnakeGameLib/Snake.cs:62:13
         {
             //set a new direction if there are any on queue and direction is valid
             if (DirectionQueue.Count > 0)
-            {
-                EDirectionType tentativeDirection = DirectionQueue.Dequeue();
-                if (tentativeDirection == EDirectionType.UP &&
-                    Direction != EDirectionType.DOWN &&
-                    Direction != EDirectionType.UP)
-                    Direction = tentativeDirection;
-                if (tentativeDirection == EDirectionType.DOWN &&
-                    Direction != EDirectionType.UP &&
-                    Direction != EDirectionType.DOWN)
-                    Direction = tentativeDirection;
-                if (tentativeDirection == EDirectionType.RIGHT &&
-                    Direction != EDirectionType.LEFT &&
-                    Direction != EDirectionType.RIGHT)
-                    Direction = tentativeDirection;
-                if (tentativeDirection == EDirectionType.LEFT &&
-                    Direction != EDirectionType.RIGHT &&
-                    Direction != EDirectionType.LEFT)
-                    Direction = tentativeDirection;
-            }
+            {}
 
             //move last position to first position 

[Killed] Negate expression
repos/SnakeGameCSharp/SnakeGameLib/Snake.cs:64:21
             if (DirectionQueue.Count > 0)
             {
                 EDirectionType tentativeDirection = DirectionQueue.Dequeue();
-                if (tentativeDirection == EDirectionType.UP &&
-                    Direction != EDirectionType.DOWN &&
-                    Direction != EDirectionType.UP)
+                if (!(tentativeDirection == EDirectionType.UP &&
+                    Direction != EDirectionType.DOWN &&
+                    Direction != EDirectionType.UP))
                     Direction = tentativeDirection;
                 if (tentativeDirection == EDirectionType.DOWN &&

[Killed] Logical mutation
repos/SnakeGameCSharp/SnakeGameLib/Snake.cs:64:21
             if (DirectionQueue.Count > 0)
             {
                 EDirectionType tentativeDirection = DirectionQueue.Dequeue();
-                if (tentativeDirection == EDirectionType.UP &&
-                    Direction != EDirectionType.DOWN &&
-                    Direction != EDirectionType.UP)
+                if (tentativeDirection == EDirectionType.UP &&
+                    Direction != EDirectionType.DOWN ||
+                    Direction != EDirectionType.UP)
                     Direction = tentativeDirection;
                 if (tentativeDirection == EDirectionType.DOWN &&

[Killed] Equality mutation
repos/SnakeGameCSharp/SnakeGameLib/Snake.cs:65:21
             {
                 EDirectionType tentativeDirection = DirectionQueue.Dequeue();
                 if (tentativeDirection == EDirectionType.UP &&
-                    Direction != EDirectionType.DOWN &&
+                                        Direction == EDirectionType.DOWN  &&
                     Direction != EDirectionType.UP)
                     Direction = tentativeDirection;

[Killed] Equality mutation
repos/SnakeGameCSharp/SnakeGameLib/Snake.cs:66:21
                 EDirectionType tentativeDirection = DirectionQueue.Dequeue();
                 if (tentativeDirection == EDirectionType.UP &&
                     Direction != EDirectionType.DOWN &&
-                    Direction != EDirectionType.UP)
+                                        Direction == EDirectionType.UP)
                     Direction = tentativeDirection;
                 if (tentativeDirection == EDirectionType.DOWN &&

[Killed] Logical mutation
repos/SnakeGameCSharp/SnakeGameLib/Snake.cs:68:21
                     Direction != EDirectionType.DOWN &&
                     Direction != EDirectionType.UP)
                     Direction = tentativeDirection;
-                if (tentativeDirection == EDirectionType.DOWN &&
-                    Direction != EDirectionType.UP &&
+                if (tentativeDirection == EDirectionType.DOWN ||
+                    Direction != EDirectionType.UP  &&
                     Direction != EDirectionType.DOWN)
                     Direction = tentativeDirection;

[Killed] Equality mutation
repos/SnakeGameCSharp/SnakeGameLib/Snake.cs:68:21
                     Direction != EDirectionType.DOWN &&
                     Direction != EDirectionType.UP)
                     Direction = tentativeDirection;
-                if (tentativeDirection == EDirectionType.DOWN &&
+                if (tentativeDirection != EDirectionType.DOWN  &&
                     Direction != EDirectionType.UP &&
                     Direction != EDirectionType.DOWN)

[Killed] Equality mutation
repos/SnakeGameCSharp/SnakeGameLib/Snake.cs:69:21
                     Direction != EDirectionType.UP)
                     Direction = tentativeDirection;
                 if (tentativeDirection == EDirectionType.DOWN &&
-                    Direction != EDirectionType.UP &&
+                                        Direction == EDirectionType.UP  &&
                     Direction != EDirectionType.DOWN)
                     Direction = tentativeDirection;

[Killed] Equality mutation
repos/SnakeGameCSharp/SnakeGameLib/Snake.cs:70:21
                     Direction = tentativeDirection;
                 if (tentativeDirection == EDirectionType.DOWN &&
                     Direction != EDirectionType.UP &&
-                    Direction != EDirectionType.DOWN)
+                                        Direction == EDirectionType.DOWN)
                     Direction = tentativeDirection;
                 if (tentativeDirection == EDirectionType.RIGHT &&

[Killed] Logical mutation
repos/SnakeGameCSharp/SnakeGameLib/Snake.cs:72:21
                     Direction != EDirectionType.UP &&
                     Direction != EDirectionType.DOWN)
                     Direction = tentativeDirection;
-                if (tentativeDirection == EDirectionType.RIGHT &&
-                    Direction != EDirectionType.LEFT &&
-                    Direction != EDirectionType.RIGHT)
+                if (tentativeDirection == EDirectionType.RIGHT &&
+                    Direction != EDirectionType.LEFT ||
+                    Direction != EDirectionType.RIGHT)
                     Direction = tentativeDirection;
                 if (tentativeDirection == EDirectionType.LEFT &&

[Killed] Equality mutation
repos/SnakeGameCSharp/SnakeGameLib/Snake.cs:72:21
                     Direction != EDirectionType.UP &&
                     Direction != EDirectionType.DOWN)
                     Direction = tentativeDirection;
-                if (tentativeDirection == EDirectionType.RIGHT &&
+                if (tentativeDirection != EDirectionType.RIGHT  &&
                     Direction != EDirectionType.LEFT &&
                     Direction != EDirectionType.RIGHT)

[Killed] Equality mutation
repos/SnakeGameCSharp/SnakeGameLib/Snake.cs:73:21
                     Direction != EDirectionType.DOWN)
                     Direction = tentativeDirection;
                 if (tentativeDirection == EDirectionType.RIGHT &&
-                    Direction != EDirectionType.LEFT &&
+                                        Direction == EDirectionType.LEFT  &&
                     Direction != EDirectionType.RIGHT)
                     Direction = tentativeDirection;

[Killed] Equality mutation
repos/SnakeGameCSharp/SnakeGameLib/Snake.cs:74:21
                     Direction = tentativeDirection;
                 if (tentativeDirection == EDirectionType.RIGHT &&
                     Direction != EDirectionType.LEFT &&
-                    Direction != EDirectionType.RIGHT)
+                                        Direction == EDirectionType.RIGHT)
                     Direction = tentativeDirection;
                 if (tentativeDirection == EDirectionType.LEFT &&

[Killed] Negate expression
repos/SnakeGameCSharp/SnakeGameLib/Snake.cs:76:21
                     Direction != EDirectionType.LEFT &&
                     Direction != EDirectionType.RIGHT)
                     Direction = tentativeDirection;
-                if (tentativeDirection == EDirectionType.LEFT &&
-                    Direction != EDirectionType.RIGHT &&
-                    Direction != EDirectionType.LEFT)
+                if (!(tentativeDirection == EDirectionType.LEFT &&
+                    Direction != EDirectionType.RIGHT &&
+                    Direction != EDirectionType.LEFT))
                     Direction = tentativeDirection;
             }

[Killed] Equality mutation
repos/SnakeGameCSharp/SnakeGameLib/Snake.cs:76:21
                     Direction != EDirectionType.LEFT &&
                     Direction != EDirectionType.RIGHT)
                     Direction = tentativeDirection;
-                if (tentativeDirection == EDirectionType.LEFT &&
+                if (tentativeDirection != EDirectionType.LEFT  &&
                     Direction != EDirectionType.RIGHT &&
                     Direction != EDirectionType.LEFT)

[Killed] Equality mutation
repos/SnakeGameCSharp/SnakeGameLib/Snake.cs:77:21
                     Direction != EDirectionType.RIGHT)
                     Direction = tentativeDirection;
                 if (tentativeDirection == EDirectionType.LEFT &&
-                    Direction != EDirectionType.RIGHT &&
+                                        Direction == EDirectionType.RIGHT  &&
                     Direction != EDirectionType.LEFT)
                     Direction = tentativeDirection;

[Killed] Equality mutation
repos/SnakeGameCSharp/SnakeGameLib/Snake.cs:78:21
                     Direction = tentativeDirection;
                 if (tentativeDirection == EDirectionType.LEFT &&
                     Direction != EDirectionType.RIGHT &&
-                    Direction != EDirectionType.LEFT)
+                                        Direction == EDirectionType.LEFT)
                     Direction = tentativeDirection;
             }

[Killed] Linq method mutation (Last() to First())
repos/SnakeGameCSharp/SnakeGameLib/Snake.cs:83:13
             }
 
             //move last position to first position 
-            BodyPositions.Last()[0] = BodyPositions.First()[0];
+            
+            //move last position to first position 
+            BodyPositions.First()[0] = BodyPositions.First()[0];
             BodyPositions.Last()[1] = BodyPositions.First()[1];
             BodyPositions.AddFirst(BodyPositions.Last());

[Survived] Linq method mutation (First() to FirstOrDefault())
repos/SnakeGameCSharp/SnakeGameLib/Snake.cs:83:39
             }
 
             //move last position to first position 
-            BodyPositions.Last()[0] = BodyPositions.First()[0];
+            BodyPositions.Last()[0] = BodyPositions.FirstOrDefault()[0];
             BodyPositions.Last()[1] = BodyPositions.First()[1];
             BodyPositions.AddFirst(BodyPositions.Last());

[Killed] Linq method mutation (Last() to First())
repos/SnakeGameCSharp/SnakeGameLib/Snake.cs:84:13
 
             //move last position to first position 
             BodyPositions.Last()[0] = BodyPositions.First()[0];
-            BodyPositions.Last()[1] = BodyPositions.First()[1];
+                        BodyPositions.First()[1] = BodyPositions.First()[1];
             BodyPositions.AddFirst(BodyPositions.Last());
             BodyPositions.RemoveLast();

[Survived] Linq method mutation (First() to FirstOrDefault())
repos/SnakeGameCSharp/SnakeGameLib/Snake.cs:84:39
 
             //move last position to first position 
             BodyPositions.Last()[0] = BodyPositions.First()[0];
-            BodyPositions.Last()[1] = BodyPositions.First()[1];
+            BodyPositions.Last()[1] = BodyPositions.FirstOrDefault()[1];
             BodyPositions.AddFirst(BodyPositions.Last());
             BodyPositions.RemoveLast();

[Killed] Linq method mutation (Last() to First())
repos/SnakeGameCSharp/SnakeGameLib/Snake.cs:85:36
             //move last position to first position 
             BodyPositions.Last()[0] = BodyPositions.First()[0];
             BodyPositions.Last()[1] = BodyPositions.First()[1];
-            BodyPositions.AddFirst(BodyPositions.Last());
+            BodyPositions.AddFirst(BodyPositions.First());
             BodyPositions.RemoveLast();
 

[Killed] Statement mutation
repos/SnakeGameCSharp/SnakeGameLib/Snake.cs:85:13
             //move last position to first position 
             BodyPositions.Last()[0] = BodyPositions.First()[0];
             BodyPositions.Last()[1] = BodyPositions.First()[1];
-            BodyPositions.AddFirst(BodyPositions.Last());
+            ;
             BodyPositions.RemoveLast();
 

[Killed] Statement mutation
repos/SnakeGameCSharp/SnakeGameLib/Snake.cs:86:13
             BodyPositions.Last()[0] = BodyPositions.First()[0];
             BodyPositions.Last()[1] = BodyPositions.First()[1];
             BodyPositions.AddFirst(BodyPositions.Last());
-            BodyPositions.RemoveLast();
+            ;
 
             //increment first position in the current direction

[Killed] Statement mutation
repos/SnakeGameCSharp/SnakeGameLib/Snake.cs:89:49
             BodyPositions.RemoveLast();
 
             //increment first position in the current direction
-            if (Direction == EDirectionType.UP) BodyPositions.First()[1]--;
+            if (Direction == EDirectionType.UP) ;
             else if (Direction == EDirectionType.DOWN) BodyPositions.First()[1]++;
             else if (Direction == EDirectionType.LEFT) BodyPositions.First()[0]--;

[Killed] PostDecrementExpression to PostIncrementExpression mutation
repos/SnakeGameCSharp/SnakeGameLib/Snake.cs:89:49
             BodyPositions.RemoveLast();
 
             //increment first position in the current direction
-            if (Direction == EDirectionType.UP) BodyPositions.First()[1]--;
+            if (Direction == EDirectionType.UP) BodyPositions.First()[1]++;
             else if (Direction == EDirectionType.DOWN) BodyPositions.First()[1]++;
             else if (Direction == EDirectionType.LEFT) BodyPositions.First()[0]--;

[Killed] Statement mutation
repos/SnakeGameCSharp/SnakeGameLib/Snake.cs:90:56
 
             //increment first position in the current direction
             if (Direction == EDirectionType.UP) BodyPositions.First()[1]--;
-            else if (Direction == EDirectionType.DOWN) BodyPositions.First()[1]++;
+            else if (Direction == EDirectionType.DOWN) ;
             else if (Direction == EDirectionType.LEFT) BodyPositions.First()[0]--;
             else if (Direction == EDirectionType.RIGHT) BodyPositions.First()[0]++;

[Killed] Equality mutation
repos/SnakeGameCSharp/SnakeGameLib/Snake.cs:90:22
 
             //increment first position in the current direction
             if (Direction == EDirectionType.UP) BodyPositions.First()[1]--;
-            else if (Direction == EDirectionType.DOWN) BodyPositions.First()[1]++;
+            else if (Direction != EDirectionType.DOWN) BodyPositions.First()[1]++;
             else if (Direction == EDirectionType.LEFT) BodyPositions.First()[0]--;
             else if (Direction == EDirectionType.RIGHT) BodyPositions.First()[0]++;

[Killed] Equality mutation
repos/SnakeGameCSharp/SnakeGameLib/Snake.cs:91:22
             //increment first position in the current direction
             if (Direction == EDirectionType.UP) BodyPositions.First()[1]--;
             else if (Direction == EDirectionType.DOWN) BodyPositions.First()[1]++;
-            else if (Direction == EDirectionType.LEFT) BodyPositions.First()[0]--;
+            else if (Direction != EDirectionType.LEFT) BodyPositions.First()[0]--;
             else if (Direction == EDirectionType.RIGHT) BodyPositions.First()[0]++;
 

[Killed] PostDecrementExpression to PostIncrementExpression mutation
repos/SnakeGameCSharp/SnakeGameLib/Snake.cs:91:56
             //increment first position in the current direction
             if (Direction == EDirectionType.UP) BodyPositions.First()[1]--;
             else if (Direction == EDirectionType.DOWN) BodyPositions.First()[1]++;
-            else if (Direction == EDirectionType.LEFT) BodyPositions.First()[0]--;
+            else if (Direction == EDirectionType.LEFT) BodyPositions.First()[0]++;
             else if (Direction == EDirectionType.RIGHT) BodyPositions.First()[0]++;
 

[Killed] Equality mutation
repos/SnakeGameCSharp/SnakeGameLib/Snake.cs:92:22
             if (Direction == EDirectionType.UP) BodyPositions.First()[1]--;
             else if (Direction == EDirectionType.DOWN) BodyPositions.First()[1]++;
             else if (Direction == EDirectionType.LEFT) BodyPositions.First()[0]--;
-            else if (Direction == EDirectionType.RIGHT) BodyPositions.First()[0]++;
+            else if (Direction != EDirectionType.RIGHT) BodyPositions.First()[0]++;
 
             //check if snake collides with itself

[Killed] PostIncrementExpression to PostDecrementExpression mutation
repos/SnakeGameCSharp/SnakeGameLib/Snake.cs:92:57
             if (Direction == EDirectionType.UP) BodyPositions.First()[1]--;
             else if (Direction == EDirectionType.DOWN) BodyPositions.First()[1]++;
             else if (Direction == EDirectionType.LEFT) BodyPositions.First()[0]--;
-            else if (Direction == EDirectionType.RIGHT) BodyPositions.First()[0]++;
+            else if (Direction == EDirectionType.RIGHT) BodyPositions.First()[0]--;
 
             //check if snake collides with itself

[Killed] Negate expression
repos/SnakeGameCSharp/SnakeGameLib/Snake.cs:95:17
             else if (Direction == EDirectionType.RIGHT) BodyPositions.First()[0]++;
 
             //check if snake collides with itself
-            if (Collide(new byte[] { BodyPositions.First()[0], BodyPositions.First()[1] }))
+            if (!(Collide(new byte[] { BodyPositions.First()[0], BodyPositions.First()[1] })))
                 CollisionWithSelf = true;
 

[Survived] Linq method mutation (First() to FirstOrDefault())
repos/SnakeGameCSharp/SnakeGameLib/Snake.cs:95:64
             else if (Direction == EDirectionType.RIGHT) BodyPositions.First()[0]++;
 
             //check if snake collides with itself
-            if (Collide(new byte[] { BodyPositions.First()[0], BodyPositions.First()[1] }))
+            if (Collide(new byte[] { BodyPositions.First()[0], BodyPositions.FirstOrDefault()[1] }))
                 CollisionWithSelf = true;
 

[Killed] Boolean mutation
repos/SnakeGameCSharp/SnakeGameLib/Snake.cs:96:37
 
             //check if snake collides with itself
             if (Collide(new byte[] { BodyPositions.First()[0], BodyPositions.First()[1] }))
-                CollisionWithSelf = true;
+                CollisionWithSelf = false;
 
         }

[Killed] Block removal mutation
repos/SnakeGameCSharp/SnakeGameLib/Snake.cs:109:9
         /// <param name="ignoreHead">Ignores the first position (head) in collision test.</param>
         /// <returns></returns>
         public virtual bool Collide(byte[] colliderPosition, bool ignoreHead = false)
-        {
-            foreach (byte[] bodyPart in BodyPositions)
-            {
-                if (colliderPosition[0] == bodyPart[0] &&
-                    colliderPosition[1] == bodyPart[1] &&
-                    bodyPart != BodyPositions.First()) return true;
-            }
-            return false;
-        }
+        {}
         #endregion
     }

[Killed] Block removal mutation
repos/SnakeGameCSharp/SnakeGameLib/Snake.cs:111:13
         public virtual bool Collide(byte[] colliderPosition, bool ignoreHead = false)
         {
             foreach (byte[] bodyPart in BodyPositions)
-            {
-                if (colliderPosition[0] == bodyPart[0] &&
-                    colliderPosition[1] == bodyPart[1] &&
-                    bodyPart != BodyPositions.First()) return true;
-            }
+            {}
             return false;
         }

[Killed] Logical mutation
repos/SnakeGameCSharp/SnakeGameLib/Snake.cs:112:21
         {
             foreach (byte[] bodyPart in BodyPositions)
             {
-                if (colliderPosition[0] == bodyPart[0] &&
-                    colliderPosition[1] == bodyPart[1] &&
-                    bodyPart != BodyPositions.First()) return true;
+                if (colliderPosition[0] == bodyPart[0] &&
+                    colliderPosition[1] == bodyPart[1] ||
+                    bodyPart != BodyPositions.First()) return true;
             }
             return false;

[Killed] Equality mutation
repos/SnakeGameCSharp/SnakeGameLib/Snake.cs:112:21
         {
             foreach (byte[] bodyPart in BodyPositions)
             {
-                if (colliderPosition[0] == bodyPart[0] &&
+                if (colliderPosition[0] != bodyPart[0]  &&
                     colliderPosition[1] == bodyPart[1] &&
                     bodyPart != BodyPositions.First()) return true;

[Killed] Equality mutation
repos/SnakeGameCSharp/SnakeGameLib/Snake.cs:113:21
             foreach (byte[] bodyPart in BodyPositions)
             {
                 if (colliderPosition[0] == bodyPart[0] &&
-                    colliderPosition[1] == bodyPart[1] &&
+                                        colliderPosition[1] != bodyPart[1]  &&
                     bodyPart != BodyPositions.First()) return true;
             }

[Killed] Equality mutation
repos/SnakeGameCSharp/SnakeGameLib/Snake.cs:114:21
             {
                 if (colliderPosition[0] == bodyPart[0] &&
                     colliderPosition[1] == bodyPart[1] &&
-                    bodyPart != BodyPositions.First()) return true;
+                                        bodyPart == BodyPositions.First()) return true;
             }
             return false;

[Killed] Boolean mutation
repos/SnakeGameCSharp/SnakeGameLib/Snake.cs:114:63
             {
                 if (colliderPosition[0] == bodyPart[0] &&
                     colliderPosition[1] == bodyPart[1] &&
-                    bodyPart != BodyPositions.First()) return true;
+                    bodyPart != BodyPositions.First()) return false;
             }
             return false;
