[Killed] Equality mutation
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:102:17
             //update snake
             Snake.Update();
             //check if snake head collides with food
-            if (ApplePosition != null &&
+            if (ApplePosition == null &&
                 Snake.BodyPositions.First()[0] == ApplePosition[0] &&
                 Snake.BodyPositions.First()[1] == ApplePosition[1])

[Killed] Block removal mutation
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:105:13
             if (ApplePosition != null &&
                 Snake.BodyPositions.First()[0] == ApplePosition[0] &&
                 Snake.BodyPositions.First()[1] == ApplePosition[1])
-            {
-                //offset food with snake direction
-                if (Snake.Direction == EDirectionType.UP) ApplePosition[1]--;
-                else if (Snake.Direction == EDirectionType.DOWN) ApplePosition[1]++;
-                else if (Snake.Direction == EDirectionType.LEFT) ApplePosition[0]--;
-                else if (Snake.Direction == EDirectionType.RIGHT) ApplePosition[0]++;
-                //make snake longer, add points 
-                Snake.BodyPositions.AddFirst(ApplePosition);
-                Snake.Points += Speed * Snake.BodyPositions.Count;
-                //generate tentative food within bounds and not on snake
-                byte[] tentativeFoodPosition;
-                //confirm tentative food position is not on snake
-                //generate new position if it is on snake
-                do tentativeFoodPosition = new byte[2] { (byte)applePositionGenerator.Next(1,MapX),
-                                        (byte)applePositionGenerator.Next(1, MapY) };
-                while (Snake.Collide(tentativeFoodPosition, true));
-                //add new food
-                ApplePosition = tentativeFoodPosition;
-                pointDeductTimer.Restart();
-            }
+            {}
             //
             if (pointDeductTimer.ElapsedMilliseconds > DeductSpeedMS)

[Killed] PostDecrementExpression to PostIncrementExpression mutation
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:107:59
                 Snake.BodyPositions.First()[1] == ApplePosition[1])
             {
                 //offset food with snake direction
-                if (Snake.Direction == EDirectionType.UP) ApplePosition[1]--;
+                if (Snake.Direction == EDirectionType.UP) ApplePosition[1]++;
                 else if (Snake.Direction == EDirectionType.DOWN) ApplePosition[1]++;
                 else if (Snake.Direction == EDirectionType.LEFT) ApplePosition[0]--;

[Killed] PostDecrementExpression to PostIncrementExpression mutation
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:109:66
                 //offset food with snake direction
                 if (Snake.Direction == EDirectionType.UP) ApplePosition[1]--;
                 else if (Snake.Direction == EDirectionType.DOWN) ApplePosition[1]++;
-                else if (Snake.Direction == EDirectionType.LEFT) ApplePosition[0]--;
+                else if (Snake.Direction == EDirectionType.LEFT) ApplePosition[0]++;
                 else if (Snake.Direction == EDirectionType.RIGHT) ApplePosition[0]++;
                 //make snake longer, add points 

[Survived] Boolean mutation
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:120:61
                 //generate new position if it is on snake
                 do tentativeFoodPosition = new byte[2] { (byte)applePositionGenerator.Next(1,MapX),
                                         (byte)applePositionGenerator.Next(1, MapY) };
-                while (Snake.Collide(tentativeFoodPosition, true));
+                while (Snake.Collide(tentativeFoodPosition, false));
                 //add new food
                 ApplePosition = tentativeFoodPosition;

[Survived] Equality mutation
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:146:21
             //else if snake is out of bounds, end game if it is
             else
             {
-                if (Snake.BodyPositions.First()[0] <= 0) GameState = EGameState.NotRunning;
+                if (Snake.BodyPositions.First()[0] > 0) GameState = EGameState.NotRunning;
                 else if (Snake.BodyPositions.First()[0] >= MapX) GameState = EGameState.NotRunning;
                 else if (Snake.BodyPositions.First()[1] <= 0) GameState = EGameState.NotRunning;

[Survived] Linq method mutation (First() to FirstOrDefault())
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:147:26
             else
             {
                 if (Snake.BodyPositions.First()[0] <= 0) GameState = EGameState.NotRunning;
-                else if (Snake.BodyPositions.First()[0] >= MapX) GameState = EGameState.NotRunning;
+                else if (Snake.BodyPositions.FirstOrDefault()[0] >= MapX) GameState = EGameState.NotRunning;
                 else if (Snake.BodyPositions.First()[1] <= 0) GameState = EGameState.NotRunning;
                 else if (Snake.BodyPositions.First()[1] >= MapY) GameState = EGameState.NotRunning;

[Survived] Negate expression
repos/SnakeGameCSharp/SnakeGameLib/Game.cs:148:26
             {
                 if (Snake.BodyPositions.First()[0] <= 0) GameState = EGameState.NotRunning;
                 else if (Snake.BodyPositions.First()[0] >= MapX) GameState = EGameState.NotRunning;
-                else if (Snake.BodyPositions.First()[1] <= 0) GameState = EGameState.NotRunning;
+                else if (!(Snake.BodyPositions.First()[1] <= 0)) GameState = EGameState.NotRunning;
                 else if (Snake.BodyPositions.First()[1] >= MapY) GameState = EGameState.NotRunning;
             }
