[Killed] Logical mutation
repos/SnakeGameCSharp/SnakeGameLib/Snake.cs:68:21
                     Direction != EDirectionType.DOWN &&
                     Direction != EDirectionType.UP)
                     Direction = tentativeDirection;
-                if (tentativeDirection == EDirectionType.DOWN &&
-                    Direction != EDirectionType.UP &&
-                    Direction != EDirectionType.DOWN)
+                if (tentativeDirection == EDirectionType.DOWN &&
+                    Direction != EDirectionType.UP ||
+                    Direction != EDirectionType.DOWN)
                     Direction = tentativeDirection;
                 if (tentativeDirection == EDirectionType.RIGHT &&

[Killed] Logical mutation
repos/SnakeGameCSharp/SnakeGameLib/Snake.cs:76:21
                     Direction != EDirectionType.LEFT &&
                     Direction != EDirectionType.RIGHT)
                     Direction = tentativeDirection;
-                if (tentativeDirection == EDirectionType.LEFT &&
-                    Direction != EDirectionType.RIGHT &&
+                if (tentativeDirection == EDirectionType.LEFT ||
+                    Direction != EDirectionType.RIGHT &&
                     Direction != EDirectionType.LEFT)
                     Direction = tentativeDirection;

[Killed] Linq method mutation (Last() to First())
repos/SnakeGameCSharp/SnakeGameLib/Snake.cs:83:13
             }
 
             //move last position to first position 
-            BodyPositions.Last()[0] = BodyPositions.First()[0];
+            BodyPositions.First()[0] = BodyPositions.First()[0];
             BodyPositions.Last()[1] = BodyPositions.First()[1];
             BodyPositions.AddFirst(BodyPositions.Last());

[Killed] Logical mutation
repos/SnakeGameCSharp/SnakeGameLib/Snake.cs:112:21
         {
             foreach (byte[] bodyPart in BodyPositions)
             {
-                if (colliderPosition[0] == bodyPart[0] &&
-                    colliderPosition[1] == bodyPart[1] &&
+                if (colliderPosition[0] == bodyPart[0] ||
+                    colliderPosition[1] == bodyPart[1] &&
                     bodyPart != BodyPositions.First()) return true;
             }
